DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-tombstone/src/main.cpp
/*
 * Draws the dirt-colored background used in the game other screens
 */
void drawBackground()
{
  tft.fillScreen(BROWN_COLOR);
  tft.drawRGBBitmap(BORDER_LEFT, BORDER_TOP, (uint16_t *)tombstone_title, TITLE_WD, TITLE_HT);
}

/*
 * Displays the title/options screen
 */
void drawTitleScreen()
{
  wav->stop();
  tft.fillRect(GAME_LEFT, GAME_TOP, GAME_WD, GAME_HT + STATUS_HT, DIRT_COLOR);
  
  tft.setTextColor(ILI9341_BLACK);  
  tft.setTextSize(2);
  tft.setCursor(40, 80);
  tft.print("[A] LEVEL 1 = NOVICE");
  tft.setCursor(40, 100);
  tft.print("[B] LEVEL 2 = MASTER");
  tft.setCursor(40, 120);
  tft.print("[X] LEVEL 3 = INSANE");

  tft.setCursor(90, 160);
  tft.print("YOUR CHOICE?");

  tft.setCursor(44, 200);
  tft.print("PRESS [Y] FOR RULES");

  game_state = STATE_TITLE;
}

/*
 * Displays the player rules and information screen.
 */
void drawRulesScreen()
{
  tft.fillRect(GAME_LEFT, GAME_TOP, GAME_WD, GAME_HT + STATUS_HT, DIRT_COLOR);
  
  tft.setTextColor(ILI9341_BLACK);  
  tft.setTextSize(2);
  tft.setCursor(60, 50);
  tft.print("MOVE");
  tft.setCursor(190, 50);
  tft.print("DIR BTNS");
  
  tft.setCursor(60, 70);
  tft.print("FIRE");
  tft.setCursor(190, 70);
  tft.print("[A]-[B]");

  tft.drawRGBBitmap(44, 104, (uint16_t *)cactus_tile, 10, 10);
  tft.setCursor(60, 100);
  tft.print("SAGUARO");
  tft.setCursor(190, 100);
  tft.print("  0 PTS");

  tft.drawRGBBitmap(44, 124, (uint16_t *)tumbleweed_tile, 10, 10);
  tft.setCursor(60, 120);
  tft.print("TUMBLEWEED");
  tft.setCursor(190, 120);
  tft.print("100 PTS");

  tft.drawRGBBitmap(44, 144, (uint16_t *)morg1_tile, 10, 10);
  tft.setCursor(60, 140);
  tft.print("MORG");
  tft.setCursor(190, 140);
  tft.print("150 PTS");

  tft.setCursor(60, 170);
  tft.print("PAUSE GAME");
  tft.setCursor(234, 170);
  tft.println("[X]");

  tft.setCursor(60, 190);
  tft.print("PANIC BUTTON");
  tft.setCursor(234, 190);
  tft.print("[Y]");

  //tft.fillRect(160, 60, 4, 10, BROWN_COLOR);

  tft.setCursor(36, 210);
  tft.print("PRESS [Y] TO CONTINUE");

  game_state = STATE_RULES;
}

/*
 * Displays the game screen and status area
 */
void drawGameScreen() 
{ 
  // Clear out the entire game screen area
  tft.fillRect(GAME_LEFT, GAME_TOP, GAME_WD, GAME_HT + STATUS_HT, DIRT_COLOR);

  drawCity(true);

  // status area separator bar
  tft.fillRect(BORDER_LEFT, STATUS_TOP, GAME_WD, 4, ILI9341_BLACK);

  tft.setTextColor(ILI9341_BLACK);  
  tft.setTextSize(1);
  
  tft.setCursor(GAME_LEFT + 10, STATUS_TOP + 8);
  tft.print("DAY");
  drawDay();

  tft.setCursor(GAME_LEFT + 80, STATUS_TOP + 8);
  tft.print("POPULATION");
  drawPopulation();

  tft.setCursor(GAME_LEFT + 200, STATUS_TOP + 8);
  tft.print("SCHOONERS");
  drawSchooners();

  addCacti(10 + difficulty * 5);  
  addSpawnCacti(difficulty); // ensure that we have at least one spawning pair
  
  addTumbleweeds(10 + 5 * difficulty);  // testing
  addMorgs(difficulty);  

  playerStart();

  game_state = STATE_PLAYING;
}

/*
 * Updates the displayed Day value (aka the Wave #)
 */
void drawDay() 
{
  tft.setTextColor(ILI9341_BLACK);  
  tft.fillRect(GAME_LEFT + 10, STATUS_TOP + 18, 60, 10, DIRT_COLOR);
  tft.setCursor(GAME_LEFT + 10, STATUS_TOP + 18);
  tft.print(day);
}

/*
 * Updates the displayed Population value (aka the Score)
 */
void drawPopulation() 
{
  tft.setTextColor(ILI9341_BLACK);  
  tft.fillRect(GAME_LEFT + 80, STATUS_TOP + 18, 60, 10, DIRT_COLOR);
  tft.setCursor(GAME_LEFT + 80, STATUS_TOP + 18);
  tft.print(population);
}

/*
 * Updates the displayed Schooners value (aka the Player Lives remaining)
 */
void drawSchooners() 
{
  tft.setTextColor(ILI9341_BLACK);  
  tft.fillRect(GAME_LEFT + 200, STATUS_TOP + 18, 60, 10, DIRT_COLOR);
  tft.setCursor(GAME_LEFT + 200, STATUS_TOP + 18);
  tft.print(schooners);
}

/*
 * Displays the PAUSED message at the top of the screen and waits until Y is pressed again
 */
void drawPaused()
{
  tft.fillRect(GAME_LEFT + 80, GAME_TOP - 20, 112, 20, ILI9341_CYAN);
  tft.setCursor( GAME_LEFT + 100, GAME_TOP - 14);
  tft.print("** PAUSED **");
  
  game_state = STATE_PAUSED;
  delayAudio(100);
}

/*
 * Erases the PAUSED message at the top of the screen and goes back to normal game playing
 */
void erasePaused()
{
  tft.drawRGBBitmap(BORDER_LEFT, BORDER_TOP, (uint16_t *)tombstone_title, TITLE_WD, TITLE_HT);
  game_state = STATE_PLAYING;
}

/*
 * That's all folks - draw the GAME OVER message
 */
void drawGameOver()
{
  tft.fillRect(GAME_LEFT + 80, GAME_TOP + 80, 100, TILE_SIZE, DIRT_COLOR);
  tft.setCursor( GAME_LEFT + 110, GAME_TOP + 81);
  tft.print("GAME OVER");
  
  playThemeSong();

  tft.fillRect(GAME_LEFT + 80, GAME_TOP + 100, 100, TILE_SIZE, DIRT_COLOR);
  tft.setCursor( GAME_LEFT + 70, GAME_TOP + 101);
  tft.print("PRESS [Y] TO RESTART");

  game_state = STATE_GAME_OVER;
}


/*
 * Displays the central 4x4 grid of blocks representing the city. 
 * When active, the blocks will have a light blue center, indicating that a spawn is pending.
 */
void drawCity(bool active)  // the center 4x4 grid of blue blocks
{
  for (int row = 5; row < 12; row+= 2)
  {
    for (int col = 10; col < 17; col+= 2)
    {
      tft.fillRect(GAME_LEFT + col * TILE_SIZE, GAME_TOP + row * TILE_SIZE, TILE_SIZE, TILE_SIZE, ILI9341_BLUE); 
      if (active)
      {
        tft.fillRect(GAME_LEFT + 2 + col * TILE_SIZE, GAME_TOP + 2 + row * TILE_SIZE, TILE_SIZE - 4, TILE_SIZE - 4, ILI9341_CYAN); 
      }
      setTileType(row, col, TILE_BLOCK, false);
    }
  }
}

/*
 * Displays the player Schooner at it's current location and direction.
 */
void drawPlayer()  
{
  switch(player_dir)
  {
    case DIR_UP:
      tft.drawRGBBitmap(player_col * TILE_SIZE + GAME_LEFT, player_row * TILE_SIZE + GAME_TOP, (uint16_t *)player_up_tile, TILE_SIZE, TILE_SIZE); break;
    case DIR_DOWN:
      tft.drawRGBBitmap(player_col * TILE_SIZE + GAME_LEFT, player_row * TILE_SIZE + GAME_TOP, (uint16_t *)player_down_tile, TILE_SIZE, TILE_SIZE); break;
    case DIR_LEFT:
      tft.drawRGBBitmap(player_col * TILE_SIZE + GAME_LEFT, player_row * TILE_SIZE + GAME_TOP, (uint16_t *)player_left_tile, TILE_SIZE, TILE_SIZE); break;
    case DIR_RIGHT:
      tft.drawRGBBitmap(player_col * TILE_SIZE + GAME_LEFT, player_row * TILE_SIZE + GAME_TOP, (uint16_t *)player_right_tile, TILE_SIZE, TILE_SIZE); break;
    default:
      tft.drawRGBBitmap(player_col * TILE_SIZE + GAME_LEFT, player_row * TILE_SIZE + GAME_TOP, (uint16_t *)player_up_tile, TILE_SIZE, TILE_SIZE); 
  }
}

