DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-tombstone/src/main.cpp
/*
 * Moves the player in the requested direction.  Also handles enemy collisions and obstacle checking.
 */
void movePlayer(uint8_t moveDirection, int rowChg, int colChg)
{
  if (moveDirection != player_dir)
  {
    // just have player face in the new direction
    player_dir = moveDirection;
    drawPlayer();
    return;
  }

  if (isOutOfBounds(player_row + rowChg, player_col + colChg))
    return;

  uint8_t tile = getTileType(player_row + rowChg, player_col + colChg);
 
  if (tile == TILE_EMPTY)
  {
    setTileType(player_row, player_col, TILE_EMPTY, true);
    player_row += rowChg;
    player_col += colChg;
    drawPlayer();
    setTileType(player_row, player_col, TILE_PLAYER, false);
    return;
  }
   
  if (tile == TILE_MORG)
  {
      killPlayer();
      return;
  }
  
}

/*
 * Handles pathfinding logic for the morg at the specified game_grid index.
 * Morgs always try to move towards the player.
 */
void moveMorg(int gridIndex)
{
  uint8_t row, col;
  uint8_t move_row, move_col;

  if (random(MAX_SPEED) > morg_speed)
    return; // don't move
  
  row = gridIndex / GAME_COLS;
  col = gridIndex % GAME_COLS;
  move_row = row;
  move_col = col; 

  if (player_col > col)
    move_col = col + 1;

  if (player_col < col)
    move_col = col - 1;

  if (player_row > row)
    move_row = row + 1;

  if (player_row < row)
    move_row = row - 1;

  if ((move_row == player_row && col == player_col) || (row == player_row && move_col == player_col))
  {
    killPlayer();
    return;
  }

  if (move_row == row && move_col == col)
    return;  // not trying to move
    
  if (!isInCity(move_row, col) && !isOccupied(move_row, col))
  {
      setTileType(row, col, TILE_EMPTY, true);
      setTileType(move_row, col, TILE_MORG, true);
      return;
  }

  if (!isInCity(row, move_col) && !isOccupied(row, move_col))
  {
      setTileType(row, col, TILE_EMPTY, true);
      setTileType(row, move_col, TILE_MORG, true);
      return;
  }
}

/*
 * Handles movement logic for the tumbleweed at the specified game_grid index.
 * Tumbleweeds always try to run away from the player.
 */
void moveTumbleweed(int gridIndex)
{
  uint8_t row, col;
  uint8_t move_row, move_col;

  if (random(MAX_SPEED) > tumbleweed_speed)
    return; // don't move
  
  row = gridIndex / GAME_COLS;
  col = gridIndex % GAME_COLS;
  move_row = row;
  move_col = col; 

  if (player_row == row && player_col > col && col > 0)
    move_col = col - 1;

  if (player_row == row && player_col < col && col < GAME_COLS - 1)
    move_col = col + 1;

  if (player_col == col && player_row > row && row > 0)
    move_row = row - 1;

    if (player_col == col && player_row < row && row < GAME_ROWS - 1)
    move_row = row + 1;

    if (isOccupied(move_row, move_col) || isInCity(move_row, move_col))
      return;

    if (move_row != row || move_col != col)
    {
      setTileType(row, col, TILE_EMPTY, true);
      setTileType(move_row, move_col, TILE_TUMBLEWEED, true);
    }
}

/*
 * Initiates movement checks for all movement-capable tiles in the game grid (morgs and tumbleweeds)
 */
void doMovement()
{
  for (int i = 0; i < GAME_ROWS * GAME_COLS; i++)
  {
    if (game_grid[i] == TILE_TUMBLEWEED)
    {
      moveTumbleweed(i);
    }
    if (game_grid[i] == TILE_MORG)
    {
      moveMorg(i);
    }
  }
}

/*
 * Returns the game_grid index of a matching tile_type within 1 space of the (row, col) location.
 * Returns -1 if no matching neighbor is found.
 */
int getNeighborTile(int row, int col, uint8_t tile, bool allowInCity)
{
  // check clockwise starting from top
  int check_row = row - 1;
  int check_col = col;

  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  // top right
  check_row = row - 1;
  check_col = col + 1;
  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  // right
  check_row = row;
  check_col = col + 1;
  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  // bottom right
  check_row = row + 1;
  check_col = col + 1;
  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  // bottom
  check_row = row + 1;
  check_col = col;
  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  // bottom left
  check_row = row + 1;
  check_col = col - 1;
  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  // left
  check_row = row;
  check_col = col - 1;
  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  // top left
  check_row = row - 1;
  check_col = col - 1;
  if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
    return check_row * GAME_COLS + check_col;

  return -1;  // no matching neighbor found
}


/*
 * Returns the game_grid index of a matching tile_type within 1 space of the (row, col) location.
 * Returns -1 if no matching neighbor is found.
 */
int getNeighborTileEx(int row, int col, uint8_t tile, bool allowInCity, int excludeRow, int excludeCol)
{
  // check clockwise starting from top
  int check_row = row - 1;
  int check_col = col;

  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
  // top right
  check_row = row - 1;
  check_col = col + 1;
  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
  // right
  check_row = row;
  check_col = col + 1;
  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
