DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-tombstone/src/main.cpp
  // bottom right
  check_row = row + 1;
  check_col = col + 1;
  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
  // bottom
  check_row = row + 1;
  check_col = col;
  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
  // bottom left
  check_row = row + 1;
  check_col = col - 1;
  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
  // left
  check_row = row;
  check_col = col - 1;
  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
  // top left
  check_row = row - 1;
  check_col = col - 1;
  if (check_row != excludeRow || check_col != excludeCol)
  {
    if (isInBounds(check_row, check_col, allowInCity) && getTileType(check_row, check_col) == tile)
      return check_row * GAME_COLS + check_col;
  }
  
  return -1;  // no matching neighbor found
}


/*
 * Spawns a morg from the currently-active spawn cactus (as long as there is an open space around that cactus)
 */
void spawnMorg()
{
  int idx = getNeighborTile(spawn_row, spawn_col, TILE_EMPTY, false);
  if (idx >= 0)
  {
    int row = idx / GAME_COLS;
    int col = idx % GAME_COLS;
    setTileType(row, col, TILE_MORG, true);
  }

  setTileType(spawn_row, spawn_col, TILE_CACTUS, true);
}

/* 
 * Determines the next spawn point cactus location
 * sets the spawn_row and spawn_col values
 */
void prepareSpawn()
{
  int idx = -1;
  uint8_t count = random(1, 20);
  
  for (uint8_t i = 0; i < count; i++)
  {
    do 
    {
      idx = (idx + 1) % (GAME_ROWS * GAME_COLS);
      if (game_grid[idx] == TILE_CACTUS || game_grid[idx] == TILE_CACTUS_ACTIVE)
      {
        spawn_row = idx / GAME_COLS;
        spawn_col = idx % GAME_COLS;
      }
    } while (getNeighborTile(spawn_row, spawn_col, TILE_CACTUS, false) < 0);
  }

  setTileType(spawn_row, spawn_col, TILE_CACTUS_ACTIVE, true); // draw spawner
  setTileType(spawn_row, spawn_col, TILE_CACTUS, false); // simplifies cactus detection logic
}


/* 
 *  Handles the spawn timing and events.  Called every game cycle.
 */
void doSpawning()
{
  spawn_counter = (spawn_counter + 1) % spawn_max;

  if (spawn_counter == 0)
  {
    spawnMorg();
    drawCity(false);
    return;
  }

  if (spawn_counter == spawn_signal)
  {
    prepareSpawn();
    drawCity(true);
  }
}

/*
 * Returns the number of spawn-eligible cacti on the game grid.
 */
int getSpawnCount()
{
  int count = 0;
  int row, col;
  for (int i = 0; i < GAME_ROWS * GAME_COLS; i++)
  {
    if (game_grid[i] == TILE_CACTUS)
    {
      row = i / GAME_COLS;
      col = i % GAME_COLS;
      if (getNeighborTile(row, col, TILE_CACTUS, false) >= 0)
      {
        // this cactus has a cactus neighbor
        count += 1;
      }
    }
  }
  return count;
}

/*
 * Checks for 3 cacti next to each other after a morg is killed
 */
void checkCactusTriplet(int row, int col)
{
  int idx1 = getNeighborTile(row, col, TILE_CACTUS, false);
  if (idx1 < 0)
    return; // no cactus neighbor

  int row1 = idx1 / GAME_COLS;
  int col1 = idx1 % GAME_COLS;

  int idx2 = getNeighborTileEx(row1, col1, TILE_CACTUS, false, row, col);

  if (idx2 < 0)
  {
    // that cactus doesn't have a neighbor, so see if original cactus has two neighbors
    idx2 = getNeighborTileEx(row, col, TILE_CACTUS, false, row1, col1);
  }

  if (idx2 < 0)
    return; // no triplet present

  int row2 = idx2 / GAME_COLS;
  int col2 = idx2 % GAME_COLS;

  // two cacti go bye, third becomes a morg
  setTileType(row, col, TILE_EMPTY, true);
  setTileType(row1, col1, TILE_EMPTY, true);
  setTileType(row2, col2, TILE_MORG, true);

  if (getSpawnCount() < 1)
  {
    advanceDay();  
  }
}

/*
 * Plays the player shot sound
 */
void playShot()
{
  wav->stop();
  fire_file = new AudioFileSourcePROGMEM(fire_wav, sizeof(fire_wav));
  wav->begin(fire_file, out);
}

/* 
 *  Plays the explosion sound when something is destroyed
 */
void playExplosion()
{
  wav->stop();
  explosion_file = new AudioFileSourcePROGMEM(explosion_wav, sizeof(explosion_wav));
  wav->begin(explosion_file, out);
}

/* 
 *  Plays the player life sound when player is destroyed
 */
void playLife()
{
  wav->stop();
  life_file = new AudioFileSourcePROGMEM(life_wav, sizeof(life_wav));
  wav->begin(life_file, out);
}

/* 
 *  Plays the teleport sound when player hits the panic button
 */
void playTeleport()
{
  // TODO
}

/*
 * Plays the next day theme
 */
void playNextDaySong()
{
  // TODO
}

/*
 * Plays the Tombstone City theme song
 */
void playThemeSong()
{
  wav->begin(theme_file, out);
}


/* 
 * Player dies when hit by a Morg 
 */
void killPlayer()
{ 
  setTileType(player_row, player_col, TILE_EXPLOSION, true); 
  playExplosion();
  
  setTileType(player_row, player_col, TILE_EMPTY, true);
  if (shot_active)
    setTileType(shot_row, shot_col, TILE_EMPTY, true);
  
  delayAudio(500);

  if (schooners == 0)
  {
    drawGameOver();
    return;    
  }

  schooners -= 1;
  drawSchooners();
  playerStart();
}

/*
 * Handles creation of a new player shot.  Called whenever the fire button is pressed.
 */
void playerShoot()
{
  if (shot_active)
    return;
  
  playShot();
  
  shot_row = player_row;
  shot_col = player_col;
  shot_row_chg = 0;
  shot_col_chg = 0;
  shot_active = true;
  shot_is_new = true;

  switch(player_dir)
  {
    case DIR_UP:
      shot_row_chg = -1; break;
    case DIR_DOWN:
      shot_row_chg = 1; break;
    case DIR_LEFT:
      shot_col_chg = -1; break;
    case DIR_RIGHT:
      shot_col_chg = 1; break;
    default:
      shot_active = false;
  }
}

