DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-tombstone/src/main.cpp
/*
 * Teleport schooner to center of city.  Subtracts 1000 populuation.
 */
void playerPanic()
{
  if (population < 1000 || isInCity(player_row, player_col))
    return;  // can't teleport

  setTileType(player_row, player_col, TILE_EMPTY, true);
  playTeleport();
    
  player_row = 8;
  player_col = 13;
  drawPlayer();
  delayAudio(100);
}

/*
 * Moves the player shot and detects any collisions.  Called every game cycle.
 */
void moveShot()
{
  if (!shot_active)
    return;

  if (isOutOfBounds(shot_row + shot_row_chg, shot_col + shot_col_chg))
  {
    shot_active = false;
    if (!shot_is_new)
      setTileType(shot_row, shot_col, TILE_EMPTY, true);
    return;
  } 

  uint8_t tile = getTileType(shot_row + shot_row_chg, shot_col + shot_col_chg);

  if (tile == TILE_EMPTY)
  {
    if (!shot_is_new)
      setTileType(shot_row, shot_col, TILE_EMPTY, true); // erase old
    shot_row += shot_row_chg;
    shot_col += shot_col_chg;
    setTileType(shot_row, shot_col, TILE_SHOT, true);  // set new
    return;
  }

  if (tile == TILE_TUMBLEWEED)
  {
    if (!shot_is_new)
      setTileType(shot_row, shot_col, TILE_EMPTY, true);  // erase shot

    setTileType(shot_row + shot_row_chg, shot_col + shot_col_chg, TILE_EXPLOSION, true); 
    playExplosion();
    
    shot_active = false;
    population += 100;
    drawPopulation();
    delayAudio(50);
    
    setTileType(shot_row + shot_row_chg, shot_col + shot_col_chg, TILE_EMPTY, true); // erase tumbleweed
    return;
  }

  if (tile == TILE_MORG)
  {
    if (!shot_is_new)
      setTileType(shot_row, shot_col, TILE_EMPTY, true);  // erase shot

    setTileType(shot_row + shot_row_chg, shot_col + shot_col_chg, TILE_EXPLOSION, true); 
    playExplosion();
    
    shot_active = false;
    population += 150;
    drawPopulation();
    delayAudio(50);
    
    setTileType(shot_row + shot_row_chg, shot_col + shot_col_chg, TILE_CACTUS, true); // dead morg becomes cactus
    checkCactusTriplet(shot_row + shot_row_chg, shot_col + shot_col_chg);
    return;
  }

  // hit something else (cactus or city)
  shot_active = false;
  if (!shot_is_new)
      setTileType(shot_row, shot_col, TILE_EMPTY, true);  // erase shot
  
}

/*
 * Adds the number of new cacti to random locations in the game area specified in the count value.
 */
void addCacti(uint8_t count)
{
  long row, col;
  for (uint8_t i = 0; i < count; i++)
  {
    do 
    {
      row = random(GAME_ROWS);
      col = random(GAME_COLS);
    } while (isOccupied(row, col) || isInCity(row, col)); 
    
    setTileType(row, col, TILE_CACTUS, true);
  }
}

/*
 * Adds a new cactus to an existing solitary cactus it finds in order to create the specified count of spawning pairs.
 */
void addSpawnCacti(uint8_t count)
{
  int row, col, idx;
  for (int cnt = 0; cnt < count; cnt++)
  {
    for (int i = 0; i < GAME_ROWS * GAME_COLS; i++)
    {
      if (game_grid[i] == TILE_CACTUS)
      {
        row = i / GAME_COLS;
        col = i % GAME_COLS;
        if (getNeighborTile(row, col, TILE_CACTUS, false) < 0)
        {
          // this cactus has no cactus neighbors
          idx = getNeighborTile(row, col, TILE_EMPTY, false);
          if (idx >=0)
          {
            row = idx / GAME_COLS;
            col = idx % GAME_COLS;
            setTileType(row, col, TILE_CACTUS, true);
            break;
          }
        }
      }
    }
  }
}

/*
 * Adds the number of new tumbleweeds to random locations in the game area specified in the count value.
 */
void addTumbleweeds(uint8_t count)
{
  long row, col;
  for (uint8_t i = 0; i < count; i++)
  {
    do 
    {
      row = random(GAME_ROWS);
      col = random(GAME_COLS);
    } while (isOccupied(row, col) || isInCity(row, col)); 
    
    setTileType(row, col, TILE_TUMBLEWEED, true);
  }
}

/*
 * Adds the number of new morg enemies to random locations in the game area specified in the count value.
 */
void addMorgs(uint8_t count)
{
  long row, col;
  for (uint8_t i = 0; i < count; i++)
  {
    do 
    {
      row = random(GAME_ROWS);
      col = random(GAME_COLS);
    } while (isOccupied(row, col) || isInCity(row, col)); 
    
    setTileType(row, col, TILE_MORG, true);
  }
}


/*
 * Determines if the (row, col) location is outside of the allowable game tile region
 */
bool isOutOfBounds(int row, int col)
{
  if (row < 0 || row > GAME_ROWS - 1 || col < 0 || col > GAME_COLS - 1)
    return true;
  else
    return false;
}

/*
 * Determines if the (row, col) location is insided of the allowable game tile region.
 * If allowInCity is false, also makes sure the location is not inside the central city grid area.
 */
bool isInBounds(int row, int col, bool allowInCity)
{
  if (isOutOfBounds(row, col))
    return false;

  if (allowInCity)
    return true;
    
  return !isInCity(row, col);
}

/*
 * Determines if the give (row, col) coordinates are within the central city grid area.
 */
bool isInCity(int row, int col)
{
  if (row >= 5 && row <= 11 && col >= 10 && col <= 16)
    return true;
  else
    return false;
}

/*
 * Returns true if the specified (row, col) location has any value other than the ground tile_type.
 */
bool isOccupied(int row, int col)
{
  if (isOutOfBounds(row, col))
    return true;

  if (getTileType(row, col) == TILE_EMPTY)
    return false;
  
  return true;
}

/*
 * Converts the (row, col) location to a game grid index
 */
uint8_t getGridIndex(int row, int col)
{
    return row * GAME_COLS + col;
}

/*
 * Returns the tile_type at the specified (row, col) game grid location.
 */
uint8_t getTileType(int row, int col)
{
  if (!isOutOfBounds(row, col))
  {
    return game_grid[row * GAME_COLS + col];
  }
  return TILE_UNKNOWN;
}

/*
 * Sets the the tile_type at the specified (row, col) game grid location.
 * Also optionally draws the new tile to the screen.
 */
void setTileType(int row, int col, uint8_t tile, bool draw)
{
  if (!isOutOfBounds(row, col))
  {
    game_grid[row * GAME_COLS + col] = tile;
    if (draw)
    {
      switch(tile)
      {
        case TILE_EMPTY:
          tft.fillRect(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, TILE_SIZE, TILE_SIZE, DIRT_COLOR); break;
        case TILE_SHOT:
          tft.fillRect(col * TILE_SIZE + GAME_LEFT + 3, row * TILE_SIZE + GAME_TOP + 3, 4, 4, ILI9341_BLACK); break;
        case TILE_BLOCK:
          tft.fillRect(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, TILE_SIZE, TILE_SIZE, ILI9341_BLUE); break;
        case TILE_CACTUS:
          tft.drawRGBBitmap(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, (uint16_t *)cactus_tile, TILE_SIZE, TILE_SIZE); break;
        case TILE_CACTUS_ACTIVE:
          tft.drawRGBBitmap(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, (uint16_t *)cactus_active_tile, TILE_SIZE, TILE_SIZE); break;
        case TILE_TUMBLEWEED:
          tft.drawRGBBitmap(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, (uint16_t *)tumbleweed_tile, TILE_SIZE, TILE_SIZE); break;
        case TILE_MORG:  
          tft.drawRGBBitmap(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, (uint16_t *)morg1_tile, TILE_SIZE, TILE_SIZE); break;
        case TILE_EXPLOSION:  
          tft.drawRGBBitmap(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, (uint16_t *)explosion_tile, TILE_SIZE, TILE_SIZE); break;
        default:
          tft.fillRect(col * TILE_SIZE + GAME_LEFT, row * TILE_SIZE + GAME_TOP, TILE_SIZE, TILE_SIZE, DIRT_COLOR); break;
      }
    }
  }
}



