DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-tombstone/src/main.cpp
/*
 * Sets the TFT text color and optionally inverts the text.  Assumes a black background color.
 */
void setTextColor(uint16_t color, bool inverted)
{
  if (inverted)
    tft.setTextColor(ILI9341_BLACK, color);
  else
    tft.setTextColor(color, ILI9341_BLACK);
  
}

/*
 * Initialize the game settings and grid at the start of a new game.
 */
void initGame()
{
  day = 1;
  population = 0;
  schooners = 3;
  
  morg_speed = 2;  
  tumbleweed_speed = 2;

  spawn_counter = 0;
  spawn_signal = 150;  // spawn is highlighted
  spawn_max = 200;

  // Initialize the game tile grid
  for (int i = 0; i < GAME_ROWS * GAME_COLS; i++)
  {
    game_grid[i] = TILE_EMPTY;
  }
}

/*
 * Initialize the player values at the start of a game or after the player dies.
 */
void playerStart()
{
  player_row = 8;
  player_col = 13;
  player_dir = DIR_UP;
  shot_active = false;

  setTileType(player_row, player_col, TILE_PLAYER, false);
  drawPlayer();
  playLife();
}

/*
 * Advances game to the next day (difficulty level increase)
 */
void advanceDay()
{
  day += 1; 
  schooners += 1;
  drawDay();
  drawSchooners();
  playNextDaySong();
  
  addCacti(day + difficulty);
  addSpawnCacti(day + difficulty);

  if (spawn_max > 50)
    spawn_max -= 25;

  spawn_signal = spawn_max - 50;
}

/*
 * Check button presses connected to the shift register
 */
void checkButtonPresses()
{
  bool pressed = false;
  
  digitalWrite(SR_CP, LOW);
  digitalWrite(SR_PL, LOW);
  delayAudio(5);
  digitalWrite(SR_PL, HIGH);

  for(uint8_t i = 0; i < 8; i++)
  {
    btn_was_pressed[i] = btn_pressed[i];  // track previous state
    pressed = (digitalRead(SR_Q7) == LOW ? 1: 0);// read the state of the SO:
    btn_released[i] = !pressed && btn_pressed[i];
    btn_pressed[i] = pressed;
    // Shift the next button pin value into the serial data out
    digitalWrite(SR_CP, LOW);
    delay(1);
    digitalWrite(SR_CP, HIGH);
    delay(1);
    checkAudio();

    //Serial.print(i); Serial.print(": "); Serial.print(btn_pressed[i]); Serial.print(" - "); Serial.println(btn_released[i]);
  }
}

/*
 * Check the analog joystick values
 */
void checkJoysticks()
{
  // Only use the left 10 bits of the joystick pot readings
  // Center normally ends up around 460
  // May want to use analogReadResolution() at some point to eliminate the need for shifts
  joy_x_left = analogRead(JOYX_L) >> 2;
  joy_y_left = analogRead(JOYY_L) >> 2;
  
  joy_x_right = analogRead(JOYX_R) >> 2;
  joy_y_right = analogRead(JOYY_R) >> 2;
}

float normalizeJoy(int16_t joy_val)
{
  float norm_val = 1;

  // Use center "deadzone" to avoid fluctuations on an inactive stick
  if (joy_val < 450 || joy_val > 475) 
  {
    norm_val = (float)joy_val / 460.0; 
  }
  return norm_val;
}

/*
 * Updates any playing audio.  
 * Call this frequently to avoid breaks in the sound. 
 */
void checkAudio()
{
  if (wav->isRunning()) 
    {
      if (!wav->loop()) 
      {
        wav->stop();
      }
    }
}

/*
 * Waits for the specified number of milliseconds while updating audio.
 * 
 * ms: The minimum number of milliseconds to delay.
 */

void delayAudio(long ms)
{
  long start_time = millis();
  
  while (millis() - start_time < ms)
  {
    checkAudio();
  }
}

/*
 * The main program (game) loop.  Runs continuously after Setup()
 */
void loop(void) 
{
  checkAudio();
  checkButtonPresses();

  switch(game_state)
  {
    case STATE_TITLE:
      handleTitle(); break;
    case STATE_RULES:
      handleRules();break;
    case STATE_PLAYING:
      handlePlaying();break;
    case STATE_PAUSED:
      handlePaused(); break;
    case STATE_GAME_OVER:
      handleGameOver(); break;
    
  }
  
  delayAudio(50);
}

// ---- GAME STATE HANDLERS ----

/*
 * Handles the STATE_TITLE game state logic
 */
void handleTitle()
{
  if (btn_pressed[BTN_A])
  {
    difficulty = 1;
    drawGameScreen();
    return;
  }

  if (btn_pressed[BTN_B])
  {
    difficulty = 2;
    drawGameScreen();
    return;
  }

  if (btn_pressed[BTN_X])
  {
    difficulty = 3;
    drawGameScreen();
    return;
  }

  if (btn_pressed[BTN_Y])
  {
    drawRulesScreen();
  }
}

/*
 * Handles the STATE_RULES game state logic
 */
void handleRules()
{
  if (btn_pressed[BTN_Y])
  {
    drawTitleScreen();
  }
}

/*
 * Handles the STATE_PLAYING game state logic
 */
void handlePlaying()
{
  if (btn_pressed[BTN_UP])
    movePlayer(DIR_UP, -1, 0);
  else if(btn_pressed[BTN_DOWN])
     movePlayer(DIR_DOWN, 1, 0);
  else if (btn_pressed[BTN_LEFT])
    movePlayer(DIR_LEFT, 0, -1);
  else if (btn_pressed[BTN_RIGHT])
    movePlayer(DIR_RIGHT, 0, 1);
    
  if (btn_pressed[BTN_A])
    playerShoot();

  if (btn_pressed[BTN_B])
  {
    playerShoot();
  }
  
  if (btn_pressed[BTN_Y])
    playerPanic();

  if (btn_pressed[BTN_X])
  {
    drawPaused();
    return;
  }
  
  moveShot();
  shot_is_new = false;
  doMovement();
  doSpawning();
}

/*
 * Handles the STATE_PAUSED game state logic
 */
void handlePaused()
{
  if (btn_pressed[BTN_X])
  {
   erasePaused();
  }
}

/*
 * Handles the STATE_GAME_OVER game state logic
 */
void handleGameOver()
{
  if (btn_pressed[BTN_Y])
  {
    drawTitleScreen();
  }
}
